N = input()
K = int(input())
D = len(N)

ans = 0
if K == 1:
    ans = int(N[0]) + 9 * (D - 1)
elif K == 2 and D >= K:
    for d in range(2, D):  # 最大桁-1までの数え上げ
        ans += 9 * 9 * (d - 1)
    # 最大桁 最大値以外までの数え上げ
    ans += (int(N[0]) - 1) * 9 * (D - 1)
    # 最大値 最大値近辺の数え上げ
    ans += 1 * 9 * (D - 2)
    ans += int(N[1])
elif K == 3 and D >= K:
    for d in range(3, D):
        ans += 9 * 9 * 9 * (d - 1) * (d - 2) // 2
    ans += (int(N[0]) - 1) * 9 * 9 * (D - 1) * (D - 2) // 2
    if int(N[1]) > 0:
        ans += 1 * (int(N[1]) - 1) * 9 * (D - 2)
        ans += 1 * 1 * 9 * (D - 3)
        ans += 1 * 1 * int(N[2])


print(ans)

"""
Kの大きさ？で再帰的構造がありそう

最大値をとっていく時とそうじゃないとき
もっというと上3桁を使う時とそうじゃないとき -> 1個しかないのでは？

2項係数で考える感じ？

面倒なので場合分けしていく

0999
8***
98**
990*
99*0


"""
